const String sdInfo = """
    《灌籃高手》（日語：SLAM DUNK／スラムダンク，香港譯作「男兒當入樽」），是井上雄彥以高中籃球為題材的日本漫畫。從1990年至1996年在集英社《週刊少年Jump》連載。單行本全31冊，完全版全24冊，新裝再編輯版全20冊[1]。日本的漫畫發行量已超過1億2千萬冊[2]。
    籃球漫畫以不良少年櫻木花道的挑戰和成長為中心。作品中的「湘北」高中是虛構的，取材背景為日本神奈川縣的湘南地區。

    1994年獲得第40屆小學館漫畫獎少年部門。在2006年由文化廳主辦的日本文化廳媒體藝術祭「日本媒體藝數百選」中，在漫畫類別中獲得第一名[3]。根據《DA VINCI》研究共有808位漫畫家、評論家、書店店員和讀者入選，並在50年的漫畫歷史中位居漫畫排行榜的第一位。2001年發行的完全版漫畫，是集英社第一套的完全版漫畫。該書第21冊～第23冊的第一版發行量為252萬本，是當時的最高記錄[4]。截至2013年2月的累計發行量已超過1億2029萬[5]。
    《灌籃高手》的漫畫原作在1996年（27號）結束。 在後續主角們會和名朋工業高校、愛和學院高校、大榮學園高校比賽，最後輸給愛和學院高校。井上在結束時評論說：「如果不在應該結束的地方結束的話，對作品來說就是一個不幸。」[6]關於續集則提出「可能存在」[6]。2004年12月3日，井上為了感謝《灌籃高手》銷售突破一億冊，於日本神奈川縣立三崎高中廢校舍舉行三日「灌籃高手售出一億冊紀念FINAL EVENT」活動。利用四天用粉筆畫23塊教室的黑板，描述全國大賽十天之後的情形與角色的後續發展，2009年4月以「灌籃高手十日後」完全版發售。2018年6月1日「新裝再製版」發行[7]。
    2021年1月7日井上自己的推特發表新的《灌籃高手》動畫電影[8][9]。2021年4月1日東映動畫的動畫企劃案中，亦包含《灌籃高手》的動畫電影版，暫定片名為《SLAM DUNK スラムダンク 30週年紀念アニメーション映画》。2022年7月公布正式片名為《灌籃高手 THE FIRST SLAM DUNK》。""";

const String info10 = """日本配音員：草尾毅／木村昴（THE FIRST SLAM DUNK[1]）
台灣配音員：于正昇（電視版、博英社VHS版、劇場版、手遊版、THE FIRST SLAM DUNK[2][3]）／曹冀魯（博英社VHS版〈第3～4集〉）
香港配音員：梁志達（ATV版、手遊版廣告、THE FIRST SLAM DUNK[4][5]）／黃志成（飛圖LD版）／郭志權（安樂劇場版）
中國大陸配音員：張明亮（遼藝）／于正昇（THE FIRST SLAM DUNK）
本作中心人物，一年級；身高：188公分（入學時）→189.2公分（打完縣大會）；體重：83公斤；背號：10；籃球位置：大前鋒（PF，大部分比賽）、中鋒（赤木不在場時）；生日：4月1日。
和光初中畢業。國中時代曾創下連續對五十名女孩告白但全部遭到拒絕的「紀錄」。故事最初因第50位拒絕告白的女生喜歡籃球部的小田而對籃球這項運動產生敵意，在赤木晴子的游說下，同時為吸引喜愛籃球的晴子注意，在沒有籃球底子的情況下，進入了湘北高中籃球隊。父親因已過世，櫻木軍團為其最好的幾個朋友，在櫻木有需要時定必挺身而出支持櫻木。而進入籃球隊後與同樣有著被多位女性拒絕告白的宮城良田有不錯的私交。
滿頭紅髮是其明顯特徵，不熟悉櫻木的對手和觀眾往往以「紅頭」或「紅頭髮」稱呼櫻木。在海南戰敗北後剃光頭後被稱為「紅頭和尚」。個性單純易受奉承，即使在賽事中陷入低潮，只要知道晴子在擔心或鼓勵他，就會恢復元氣，因此又被櫻木軍團稱為「單純王」。常把「天才」二字掛在嘴邊，個性外向粗線條又單純。""";

const String info11 = """日本配音員：綠川光／神尾晉一郎（THE FIRST SLAM DUNK[1]）
台灣配音員：官志宏（電視版、博英社VHS版〈前期．後期〉、手遊版）／趙明哲（博英社VHS版〈中期〉）／李世揚（劇場版）／張騰（THE FIRST SLAM DUNK[2][3]）
香港配音員：雷霆（ATV版、THE FIRST SLAM DUNK[4][6]）／馮錦堂（飛圖LD版）／林國雄（安樂劇場版）
中國大陸配音員：韓力（遼藝）／官志宏（THE FIRST SLAM DUNK）
一年級；身高：187公分；體重：75公斤；背號：4（國中3年級）→11（高中一年級）；籃球位置：小前鋒（SF，大部分比賽）、大前鋒（個別情況下）；生日：1月1日。
被稱為「超級新人」，是一位全方位的球員，外線、中距離以及切入都能得分，可以說是湘北隊的王牌球員。自我中心是缺點，後來被安西教練及對手仙道點化才懂得分享球權，其實具有不錯的傳球視野。富丘中學畢業，彩子的學弟，中學時代已經是王牌級的球員。沉默寡言，總是一副撲克臉，是狂熱的籃球癡，除了練球之外，興趣是睡覺，上課時間跟騎腳踏車都能睡，因此常撞到人或路邊車輛。非常受女生歡迎（包括晴子），專屬親衛隊人數在不知不覺中持續增加，但現階段的流川只熱愛於籃球，對女人完全沒興趣，完全沒搭理異性。對陵南的練習賽賽前發球衣時，原本背號是10號，但是在櫻木插隊之下變成11號。
雖是湘北得分主力，但因具有中距離與外線能力沒被多人包夾過（縣大會最後一戰中陵南教練曾經提醒池上，如果流川楓持球就去協防包夾，但因櫻木穿給了木暮，實際上並未出現包夾的情況）。自練習賽敗給陵南後，視仙道為競爭對手，一直想著要超越仙道。
好勝心強，在比賽中比誰都認真。翔陽站中全隊其他人都受制於翔陽先發的身高時，通過個人能力打破僵局並激發全隊鬥志，其進攻能力和櫻木在防守端的能力打出了1+1>2的效果，擊潰了翔陽王牌藤真的心理。和海南的比賽中，在大幅落後以及赤木受傷下場的情況下一人獨挑得分大樑，貢獻了諸多精彩的單人進攻，包括面對神奈川第一球員牧紳一的空中拉杆灌籃，單節獨力砍下25分將比數追平。下半場因體力不支僅得6分，且在暴扣清田後倒下被換下場，但整場比賽仍然拿了湘北隊中最高的31分，只可惜最終湘北仍以2分之差敗給海南。因此吸取教訓在和陵南的比賽中學會保留體力，上半場僅得2分（比櫻木得3分少）。陵南戰後向安西教練表示希望前往美國發展，安西認為實力仍不如仙道而堅決反對，並要求先成為「日本第一」，再談美國夢。全國大賽之前和仙道在野球場1v1，被仙道點出其過於注重單打，反而忽視了自己可以利用超強的個人能力幫助球隊其他人。全國大賽首戰豐玉，在展現個人進攻能力後被豐玉隊長南烈用陰招打傷，但下半場忍著紅腫的眼睛繼續比賽，還憑藉手感閉眼罰進一球，其表現是導致南烈下半場發揮失常的關鍵。次站對山王工業時對位全國第一人澤北榮治，1v1在攻防兩端都被澤北完爆後醒悟了仙道的話語，開始用傳球為其他隊員創造機會，蛻變成真正具備「突、傳、投」三威脅的王牌球員。
黑板漫畫「十日後」中的流川沒什麼改變，依然過著邊騎車邊睡然後出車禍的日子。為了將來能到美國發展，正努力的學習英文。
一般認為作者取材自NBA芝加哥公牛隊的球員麥可·喬丹（Michael Jordan），漫畫中流川楓左手肘前的護腕也和喬丹同一位置。""";

const String info4 = """日本配音員：梁田清之、緒方惠美（少年）／三宅健太（THE FIRST SLAM DUNK[1]）
台灣配音員：胡大衛（電視版、博英社VHS版〈前期．後期〉）／李香生（博英社VHS版〈中期〉）／林谷珍（劇場版、手遊版、THE FIRST SLAM DUNK[2][3]）
香港配音員：黃志明（ATV版、THE FIRST SLAM DUNK[4][7]）
中國大陸配音員：王余昌（遼藝）／劉北辰（THE FIRST SLAM DUNK）
三年級；身高：193公分（一年級時）→197公分；體重：88公斤→93公斤；背號：4(中學3年級)→10(1年級)→8(2年級)→4(3年級)；籃球位置：中鋒（C）；生日：5月10日。
湘北籃球隊隊長，亦是晴子的兄長。從接觸籃球以來，一直懷抱著「稱霸全國」的夢想。由於長相與體型的關係，被櫻木等人稱為「大猩猩」，也跟牧一樣有被人說長相老的問題。攻守俱佳，毫無懸念為神奈川縣第一中鋒。雙手爆扣的「大猩猩灌籃」，以及壓迫對方禁區攻勢的「蒼蠅拍」是他的招牌絕技。是湘北隊內唯一被敵隊多人包夾過的球員。由於表現優異，因此被大學名校派人延攬。課業成績屬於優等生級。是湘北先發5人當中唯一的優等生，其餘4人都是紅字軍團。
黑板漫畫「十日後」提到赤木雖從籃球隊引退，但仍無法忘情籃球，上課心不在焉而成績下滑。
一般認為此角色的原型為NBA紐約尼克的中鋒派屈克·尤英（Patrick Ewing）。""";

const String info14 = """日本配音員：置鮎龍太郎／笠間淳（THE FIRST SLAM DUNK[1]）
台灣配音員：胡大衛（電視版）／李香生（博英社VHS版）／陳彥鈞（劇場版、THE FIRST SLAM DUNK[2][3]）／林谷珍（手遊版）
香港配音員：呂永林（ATV版、THE FIRST SLAM DUNK[4][8]）
中國大陸配音員：辛敏航（遼藝）／圖特哈蒙（THE FIRST SLAM DUNK）
三年級；身高：176公分→184公分；體重：63公斤→70公斤；背號：4(中學3年級)→14；籃球位置：得分後衛（SG）；生日：5月22日。
武石國中畢業王牌球員，中學時代的最有價值球員（MVP）。擁有出色三分外線能力，剛進入湘北籃球隊時被寄予厚望。無奈進了湘北不久即膝蓋受傷，在養傷期間急於回到球場導致舊傷復發。杵著拐杖的三井看見其他隊友活躍在球場上，以為無法再健康打球而灰心離場。離開籃球場後的三井自暴自棄成為不良少年，過著暴力打架的糜爛生活（但始終沒有吸菸）。曾因看不順宮城的出色表現而找他出氣，結果被他撞斷兩顆門牙。在一次闖入湘北高中體育館的衝突事件當中，與籃球隊成員衝突；但遇上恩師安西教練後，自白還是很想打籃球，再次回籃球隊。 由於與赤木同年級，成名又比赤木早，是球隊中唯一敢對赤木叫囂吐槽的人，1年級就叫赤木「大猩猩」，下場往往會被赤木追打。
回到球隊後，兩年空白導致體力下滑，但出色防守能力與球感仍在，是標準的天才型球員。加上有著永不放棄的鬥志，在疲勞的狀態下能發揮超常實力，湘北多次依賴三井的三分球追分，是湘北第二號攻擊手。因中學時代其中一場賽事中，三井被安西教練鼓勵後在最後幾秒射入絕殺三分球反敗為勝而視安西教練為恩師，其後亦因嚮往安西教練拒絕陵南的田岡教練邀請進入湘北。但其學業成績並不出色，和櫻木、流川、宮城同為紅字軍團。海南戰後的隊內練習賽原本擔任裁判，在安西教練安排下出場擔任學長隊的中鋒，將櫻木的缺點徹底展露無遺，促使櫻木開始練習在禁區投籃。
「十日後」交代三井並沒隨赤木及木暮引退，而是繼續留在湘北籃球隊拼冬季選拔賽(與棒球3年級打完夏季大賽即引退不同，籃球可繼續待到冬季選拔賽結束才引退)，藉此作為進入好大學的跳板。因為同屆的赤木與木暮引退只剩下自己，偶爾會有寂寞感覺。
一般認為其創作原型為前NBA得分後衛傑夫·霍納塞克（Jeff Hornacek）。""";

const String info7 = """日本配音員：鹽屋翼／仲村宗悟（THE FIRST SLAM DUNK[1]）
台灣配音員：于正昌（電視版、博英社VHS版〈後期〉、手遊版、THE FIRST SLAM DUNK[2][3]）／趙明哲（博英社VHS版〈前期〉）／林谷珍（劇場版）
香港配音員：黃文偉（ATV版、THE FIRST SLAM DUNK[4][9]）
中國大陸配音員：張文漁（遼藝）／谷江山（THE FIRST SLAM DUNK）
二年級；身高：168公分；體重：59公斤；背號：7；籃球位置：控球後衛（PG）；生日：7月31日。
身形矮小，但有絕佳速度、切入一流，擅長傳導及抄截，缺點為投籃不穩定，在球場上大多以切入及上籃取分。因加入球隊後表現亮眼，被當時因傷脫離籃球場成為流氓的三井仇視，因此曾跟流氓時期的三井打架導致兩人雙十受傷住院，休養半年後才重回球隊。湘北先發五人當中唯一參與所有賽事而沒因各種原因退場的全勤人物。因身高較矮，常需與比自己高很多的後衛對位。
迷戀著彩子，因休養期間不想為彩子帶來麻煩，而嘗試跟其他女生交往以忘記彩子，但被那些女生全部拒絕，讓宮城內心受創，直至遇到櫻木為止一共被10人拒絕告白。一開始非常敵視只是碰巧和彩子一起上學的櫻木，甚至和櫻木在練球時針鋒相對。但在聽到櫻木被50人拒絕告白後驚訝之餘也深受「感動」，同為天涯淪落人而與櫻木成為好友(直稱櫻木的名字「花道」，而櫻木則以綽號「小良」稱之)。
「十日後」提到在赤木引退後成為新隊長，以成為嚴格鍛練隊員的魔鬼隊長自栩。
一般認為作者取材自NBA鳳凰城太陽隊時期的凱文·詹森（Kevin Johnson）為創作原型。""";

const String infoMovie =
    """《灌籃高手 THE FIRST SLAM DUNK》是2022年上映的日本動畫電影，由漫畫《灌籃高手》原作者井上雄彥編劇和執導，同時是該系列第五部劇場動畫。故事改編自原作最終章《全國大賽篇—湘北VS山王工業》，以湘北籃球隊的主力控球後衛宮城良田為主要視角，講述良田的成長過程，還有良田繼承已故兄長對籃球的熱愛加入湘北籃球隊的延伸經歷。

電影於2022年12月3日在日本首映，後續於香港、澳門、台灣、新加坡、馬來西亞、中國大陸及其他海外地區上映，普遍獲得正面評價。角色的心境刻畫、競賽的動作場面、動畫視覺效果均獲得好評。票房收入在日本更超過100億日圓，在台灣、香港及中國大陸更是當地上映的日本電影票房排名第二名。本片在第46屆日本電影學院獎獲頒年度最優秀動畫獎[1]。

劇情
本作這次是以湘北籃球隊的主力控球後衛宮城良田為第一視角敘事，並以漫畫原作中在IH全國大賽湘北高中對戰日本高校籃壇第一強隊山王工業的賽事為故事主軸，穿插良田的過去。

良田出身沖繩縣，有一個大三歲的哥哥宗太和一個妹妹安娜。父親去世後，宗太成為家裡的支柱並扶持母親薰，宗太在國中時期是一名籃球好手，在哥哥的影響下，良田也開始對籃球充滿興趣。不料宗太後來於釣魚的海難中喪生。良田無比想念哥哥，於是決定穿著一件和哥哥相同背號的球衣繼續打球。但是良田身材矮小，球技亦不如哥哥，在學校的比賽中失利。薰也因為長子的死而心碎，帶著良田和妹妹舉家搬到神奈川縣。

在與山王的比賽中，湘北於上半場與對手打得不相上下，比數相當接近。但在下半場開始時，山王發揮實力，良田遭到對手採用二人防守針對，因為身材差距而難以脫困。湘北的中鋒赤木剛憲與山王的河田雅史相比落居下風，小前鋒流川楓也難以對抗日本第一高中生澤北榮治。比賽局勢一面倒向山王，山王一度領先達24分。

搬到神奈川縣後，良田在國中班上沒有朋友，只是一個人獨自練球，並一度巧遇日後湘北的隊友三井壽。良田升上高中後開始加入籃球隊，赤木對良田寄予厚望，但自我沉淪成為不良少年的三井不以為然，找良田打架。結果兩敗俱傷，良田鬱悶騎車時發生車禍，勉強撿回一命，母親受到很大的打擊。之後和到球隊鬧事完，將頭髮剪短髮展現決心歸隊的三井盡釋前嫌。

山王大幅領先的情況下，湘北透過暫停重整士氣，湘北大前鋒櫻木花道在教練安西光義的指點下，發揮能耐幫助隊友縮小比數。

全國大賽前，良田回到故鄉，翻看哥哥留在山洞中的東西時，想起哥哥曾立志要在高中籃壇贏過山王，並發洩了內心的感情。良田也寫了一封信給母親，反省自己只會惹母親生氣，並說明籃球是哥哥亡故後支撐他活下去的唯一事物，感謝母親讓他繼續打籃球。

在最後兩分鐘，山王僅領先5分。最後半分鐘時差距來到1分，負傷的櫻木阻斷了澤北的得分，並傳球使流川得分。然而澤北馬上在最後10秒穩穩投進一球，扳回比數。面對湘北最後的進攻機會，山王嚴密防守，流川最後一刻準備出手時注意到一旁空檔的櫻木，而將球傳給了他。櫻木在比賽結束前原地投籃成功，湘北以一分之差險勝山王。山王也學到了勝敗乃是兵家常事。

比賽結束後，良田前往海邊，向在那裡等的母親說「我回來了」。數年後，澤北和良田都從高中畢業，來到美國打籃球，兩人此時同為控球後衛，準備在一場比賽中一分高下。""";
